name: "LeNet"
layers {
  name: "mnist"
  type: DATA
  top: "data"
  top: "label"
  data_param {
    data_filename: "/home/cs_user/data/mnist/traindata.dat"
    label_filename: "/home/cs_user/data/mnist/trainlabel.dat"
    backend: ATHENA_ENTRY_PLUG
    batch_size: 256
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 1
  convolution_param {
    engine: CUDNN
    num_output: 16
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "athena_entry_plug"
      filename: "cnn_init"
      offset: 0
    }
    bias_filler {
      type: "athena_entry_plug"
      filename: "cnn_init"
      offset: 400
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 1
  convolution_param {
    num_output: 32
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "athena_entry_plug"
      filename: "cnn_init"
      offset: 416
    }
    bias_filler {
      type: "athena_entry_plug"
      filename: "cnn_init"
      offset: 13216
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layers {
  name: "ip1"
  type: INNER_PRODUCT
  bottom: "pool2"
  top: "ip1"
  blobs_lr: 1
  blobs_lr: 1
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "athena_entry_plug"
      filename: "cnn_init"
      offset: 13248
    }
    bias_filler {
      type: "athena_entry_plug"
      filename: "cnn_init"
      offset: 18368
    }
  }
}
layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip1"
  bottom: "label"
  top: "accuracy"
}
layers {
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "ip1"
  bottom: "label"
  top: "loss"
}
